create_clock -period 10.000 -name clk -waveform {0.000 5.000} [get_ports clk]
set_input_delay -clock [get_clocks clk] -min -add_delay 4.000 [get_ports {x[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 4.000 [get_ports {x[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 4.000 [get_ports {y[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 4.000 [get_ports {y[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 4.000 [get_ports {z[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 4.000 [get_ports {z[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 4.000 [get_ports act_sel]
set_input_delay -clock [get_clocks clk] -max -add_delay 4.000 [get_ports act_sel]
set_input_delay -clock [get_clocks clk] -min -add_delay 4.000 [get_ports sel]
set_input_delay -clock [get_clocks clk] -max -add_delay 4.000 [get_ports sel]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {act_out[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 4.000 [get_ports {act_out[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {xn[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 4.000 [get_ports {xn[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {yn[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 4.000 [get_ports {yn[*]}]
set_output_delay -clock [get_clocks clk] -min -add_delay 0.000 [get_ports {zn[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 4.000 [get_ports {zn[*]}]
